app/Http/Controllers/PostController.php

SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2)
SELECT * FROM `posts` ORDER BY `created_at` DESC
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 7 offset 0
SELECT count(*) as aggregate FROM `posts`
---
    public function index(){
        $title = '';
        if(request('category')){
            $category = Category::firstWhere('slug', request('category'));
            $title = ' in '. $category->name;
        }

        if(request('author')){
            $author = User::firstWhere('username', request('author'));
            $title = ' by '. $author->name;
        }

        return view('posts', [
            "title" => "All Posts ". $title,
            "active" => 'blog',
            // "post" => Post::latest()->get()
            "post" => Post::latest()->filter(request(['search', 'category', 'author']))->paginate(7)->withQueryString()
        ]);

SELECT * FROM `categories`
---
    public function category(){
        return view('categories', [
            'title' => 'Post Categories',
            'active' => 'categories',
            'categories' => Category::all()