app/Http/Controllers/RegisterController.php

INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('Taufiq Vhunakoshi', 'vhunakoshi', 'vhunakoshi@gmail.com', 'y$MUiLDimUC4UAyR0.QMFA6eAkOjenkoQChHKJRFV9KxPIDNQXQ/xs.', '2021-10-06 14:29:16', '2021-10-06 14:29:16')
---
    public function store(Request $request){
        $validatedData = $request->validate([
            'name' => 'required|max:255',
            'username' => 'required|min:3|max:255|unique:users',
            'email' => 'required|email:dns|unique:users',
            'password' => 'required|min:5|max:255'
        ]);

        // $validate['password'] = bcrypt($validated['password']);
        $validatedData['password'] = Hash::make($validatedData['password']);

        // $information = [
        //     'name' => $request->name,
        //     'username' => $request->username,
        //     'email' => $request->email,
        //     'password' => $pass
        // ];

        User::create($validatedData);